
/*:
 # أهلاً وسهلاَ ومرحباً. 🎶
 
 ستقوم بإكمال الأكواد التالية. قم فقط بالضغط على Shift وEnter بعد كل مطلوب. لا تضغط على play في الأسفل. فهي لن تعمل.
 ## المطلوب الأول
 قم بكتابة جملة Swift تقوم بطباعة "أنا أحب لغة Swift "
*/

// أكمل الكود هنا

print("انا احب لغه Swift")
print("استاذ عمر طلع يعزف قيتار و حركااااااات خووش شييي هااا")
/*:
 - - - -
## المطلوب الثاني
 قم بإصلاح الكود التالي
*/
// أكمل الكود هنا
var i = 5
var d = 4.2
var sum = Double(i) + d
print(sum)
/*:
  - - - -
## المطلوب الثالث
 قم بتعريف ٤ متغيرات.
 * الأول الاسم، وضع به قيمة اسمك.
 * الثاني العمر، وضع به قيمة عمرك.
 * الثالث تحصيلك وضع به درجتك في الشهادة الأخيرة مع الفاصلة
 * والأخير خريج وضع به قيمة true إذا كنت خريج
*/
// put the code here below

var name = "Nikola Tesla"
var age = 17
var percentage = 105.99
var Senior = true


/*:
 - - - -
## المطلوب الرابع
قم بطباعة
 
 أنا `الاسم` وعمري `العمر` ودرجتي الأخيرة `الدرجة` وطبعاً هل أنا خريج؟ `حالة خريج`
 
 */
// قم بإكمال هذا الكود
print("انا " + name)
print("عمري " + String(age))
print("درجتي الاخيره " + String(percentage))
print(" انا خريج " + String(Senior))
